scottmsilver/precor-9.3x/hardware/Esp32Tap/firmware/esp32_rs/sdkconfig.defaults
# Esp32Tap Rust safety core — the PLAN.md NORMATIVE phase-1 key set, carried
# over from firmware/esp32/sdkconfig.defaults. Network-tier keys (wifi / lwip
# / httpd / mbedtls) are omitted: this image is the safety core only.
#
# Every key here must survive into the esp-idf-sys-generated sdkconfig; the
# flashed artifact is gated by `grep CONFIG_ESP_TASK_WDT_PANIC=y sdkconfig`
# (PLAN treadmill-contact checklist item 2).

CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# --- FreeRTOS tick: 1000 Hz, NOT the IDF default 100 Hz. Guarded in
# src/tasks/mod.rs by a const assertion on esp_idf_sys::configTICK_RATE_HZ,
# so a regression is a COMPILE ERROR rather than a boot loop. (Parity with
# the C++ static_assert — Rust gives nothing extra here.)
CONFIG_FREERTOS_HZ=1000

# --- Task WDT: 2 s, panic-on-stall (MANDATORY) ---
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=2
CONFIG_ESP_TASK_WDT_PANIC=y

# --- Panic action: immediate silent reboot (-> GPIO21 Hi-Z -> R23
# pull-down -> relay released). There is deliberately no software handler.
CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT=y
# Hidden/default key; if the generated sdkconfig emits it, it must be 0
# (PLAN — nothing may delay the reset that releases the relay).
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=0
CONFIG_ESP_COREDUMP_ENABLE_TO_NONE=y
CONFIG_APPTRACE_DEST_NONE=y
CONFIG_APPTRACE_DEST_UART_NONE=y

# --- OCD-aware panic handling is a debug/halt path and is FORBIDDEN in an
# Emulate-capable build (PLAN; build_safety_manifest.py fail-closes on it).
# It is not merely cosmetic: with OCDAWARE on, the panic handler consults
# esp_cpu_dbgr_is_attached() and BREAKS/HALTS instead of resetting when a
# debugger is present — GPIO21 would stay driven and the relay latched.
#
# NOTE the IDF default is =y, so this MUST be stated explicitly. The C++
# core carries the identical line; omitting it here silently re-enabled the
# forbidden path in the Rust image and made it unshippable (the generated
# sdkconfig had CONFIG_ESP_DEBUG_OCDAWARE=y). tools/build.sh now runs
# build_safety_manifest.py over the generated sdkconfig so the whole
# FORBIDDEN_ENABLED_SDKCONFIG set is gated, not two hand-picked greps.
# CONFIG_ESP_DEBUG_OCDAWARE is not set

# --- Brownout detection on (selector left at the IDF default pending the
# measured min +3V3 of the production artifact).
CONFIG_ESP_BROWNOUT_DET=y

# --- Main task stack. Raised from the C++ core's 8192: Rust std formatting
# frames are fatter and main builds the UART drivers on this stack.
#
# Raised again 12288 -> 16384 for Slice 3. `mbedtls_x509write_crt_pem` parks a
# 4 KB DER buffer on ITS CALLER'S stack (and `mbedtls_pk_write_key_pem` a
# smaller one), and the TLS identity is generated from `main`. This is measured
# headroom, not superstition: without it the keygen overruns the main task and
# the failure appears as a boot-path stack canary, which looks like anything
# but "the certificate writer needed 4 KB".
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# --- Flash layout: the ESP-IDF STOCK 2 MB / single-app table.
#
# This is deliberate, and it is what the committed QEMU harness assumes.
# `qemu_session.py` merges the flash with `--fill-flash-size 2MB` and
# `qemu_smoke.sh` does the same; an image whose partition table places a
# partition above 2 MB cannot be booted by that harness AT ALL, and the only
# way to run it would be to edit the harness — which is exactly what this
# port must not need. The safety core is 447 KB / 461 KB, i.e. 43-44% of the
# stock 1 MB factory partition, and it owns no data partition (no LittleFS,
# no TLS identity, no history stores), so nothing here wants the larger
# table. If the port ever grows a data partition, the 8 MB N8 layout comes
# back in a QEMU-only sdkconfig fragment, never in a harness edit.
#
# (Retained for that day — the sharp edge that cost an afternoon: a RELATIVE
# CONFIG_PARTITION_TABLE_CUSTOM_FILENAME does NOT work under esp-idf-sys.
# idf.py resolves it against the project dir; esp-idf-sys generates its own
# CMake project under target/.../esp-idf-sys-<HASH>/out/ and resolves against
# THAT, and <HASH> is not knowable in advance. Use the absolute /project path
# that tools/build.sh always bind-mounts.)

# --- Rust-specific: IDF defaults to CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y.
# That peripheral is NOT emulated by esp-QEMU, the VFS write returns 0 bytes,
# and Rust std turns that into a panic on the FIRST print — a 31k-line boot
# loop. The C++ core never hit it because ESP_LOGx goes straight out UART0
# via ets_printf, bypassing the VFS. We log via ESP_LOG for the same reason,
# and set this as belt-and-braces.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- Reproducible build (added 2026-07-28) ---
#
# WHY THIS IS A SAFETY KEY, not a nicety: PLAN's "exact production artifact
# identity" section makes `bundle_sha256` — a hash of the application,
# bootloader, partition table and sdkconfig — the name every bench log, scope
# capture and contact-timing record is filed under. If two builds of identical
# source produce different bytes, that identity is meaningless: evidence can
# never be re-derived, and "rebuild and confirm the hash" is not a check
# anyone can run.
#
# Measured before this key was set: wiping the cargo target dirs and building
# the same commit twice produced DIFFERENT application and bootloader images
# (the partition table was already stable). The cause is IDF's default
# `CONFIG_APP_COMPILE_TIME_DATE=y`, which stamps __DATE__/__TIME__ into the
# esp_app_desc, plus absolute build paths in the binaries.
# CONFIG_APP_REPRODUCIBLE_BUILD=y turns both off.
CONFIG_APP_REPRODUCIBLE_BUILD=y

# Slice 1: /ws is part of the app-facing contract (status stream), so the
# WebSocket support in esp_http_server is a production feature, not test-only.
CONFIG_HTTPD_WS_SUPPORT=y

# --- Slice 3: TLS. THIS ONE KEY IS THE WHOLE "httpd_ssl_* is uncallable" BUG.
#
# The recorded blocker said esp_https_server was "absent from the bindings" and
# guessed the fix was a component whitelist. It was neither: the component was
# being BUILT the whole time (the generated build had
# `esp_idf_comp_esp_https_server_enabled`), and esp-idf-sys's stock
# src/include/esp-idf/bindings.h already carries
#
#     #ifdef CONFIG_ESP_HTTPS_SERVER_ENABLE
#     #include "esp_https_server.h"
#     #endif
#
# — gated on the KCONFIG SYMBOL, not on the component. The generated sdkconfig
# read `# CONFIG_ESP_HTTPS_SERVER_ENABLE is not set`, so bindgen never saw the
# header and emitted zero `httpd_ssl_*` symbols. One Kconfig line fixes it.
#
# Its Kconfig dependency (`depends on ESP_TLS_USING_MBEDTLS && MBEDTLS_TLS_SERVER`)
# is already satisfied by the defaults, so this key takes effect as written.
CONFIG_ESP_HTTPS_SERVER_ENABLE=y

# --- Slice 3: mDNS. The component itself is pulled in as a remote (managed)
# component from esp32tap/Cargo.toml — see the long note there. These are its
# knobs.
#
# The console CLI defaults to y and drags the `console` component (and an
# argtable/linenoise-shaped surface) into an image whose only job is to answer
# DNS-SD queries. There is no UART shell on this device; refuse it.
# CONFIG_MDNS_ENABLE_CONSOLE_CLI is not set
# One netif (ETH today, WiFi later) — the default of 3 sizes per-interface
# state we will never use.
CONFIG_MDNS_MAX_INTERFACES=1
#
# PREDEFINED INTERFACES OFF — and this is a CORRECTNESS fix, not a diet.
#
# With the predefs on, the component learns about an interface ONLY from an
# event: `mdns_preset_if_handle_system_event` enables the PCB when it sees
# ETHERNET_EVENT_CONNECTED / IP_EVENT_ETH_GOT_IP. The firmware brings the link
# up and waits for DHCP BEFORE it starts mDNS (a record must not advertise an
# address the device does not have yet), so those events have already fired by
# the time `mdns_init` registers the handler. The result is a responder that
# starts, logs success, answers `mdns_service_add` with ESP_OK — and never
# replies to a single query, because no PCB was ever enabled. That is exactly
# the failure this cost a debugging cycle to find, and it is silent.
#
# With the predefs off, `MDNS_MAX_INTERFACES` slots are all CUSTOM, so
# net/mdns.rs registers ETH_DEF explicitly and drives ENABLE_IP4/ANNOUNCE_IP4
# itself. That works whatever order the link and the responder come up in, and
# it says in the source which interface serves discovery — which matters when
# this board moves from openeth to WiFi.
# CONFIG_MDNS_PREDEF_NETIF_STA is not set
# CONFIG_MDNS_PREDEF_NETIF_AP is not set
# CONFIG_MDNS_PREDEF_NETIF_ETH is not set

# --- 8 MB layout with a data partition (added 2026-07-28) ---
#
# The note above said the 8 MB N8 table comes back "if the port ever grows a
# data partition". It has: the persistence tier needs the `storage` partition
# at 0x210000, which does not exist under the stock 2 MB table — the image
# carried only `factory` and `nvs`, and esp_partition_find_first("storage")
# returned null, so every store probe answered no_partition.
#
# The FILENAME MUST BE ABSOLUTE — the sharp edge documented above. idf.py
# resolves a relative path against the project dir, but esp-idf-sys generates
# its own CMake project under target/.../esp-idf-sys-<HASH>/out/ and resolves
# against THAT, and <HASH> is not knowable in advance. tools/build.sh always
# bind-mounts the worktree at /project, so this path is stable.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="/project/hardware/Esp32Tap/firmware/esp32_rs/partitions_esp32tap.csv"

# --- Slice 6: BLE (NimBLE). --------------------------------------------------
#
# TWO KEYS ARE THE WHOLE ENABLEMENT, and they were found by READING rather than
# probing — esp-idf-sys 0.37's own src/include/esp-idf/bindings.h gates the
# NimBLE headers on exactly `CONFIG_BT_ENABLED` plus `CONFIG_BT_NIMBLE_ENABLED`
# (and excludes only S2/P4, so the S3 is fine). BUILD-OPTIONS.md does NOT
# document them; it points at `cargo pio espidf menuconfig`, which applies to
# the `pio` builder and not the `native` one this port uses.
#
# NO `extra_components` AND NO `bindings_header` ARE NEEDED, and that is not an
# oversight — it is the mDNS lesson applied in reverse. mDNS needed
# `extra_components` because it is a MANAGED (remote) component outside base
# ESP-IDF. `bt` is a BASE component, compiled by the native builder's own CMake
# tree and gated purely by Kconfig, exactly like `esp_https_server` above:
# turning the symbol on is sufficient to make `nimble_port_*`, `ble_hs_*`,
# `ble_gap_*`, `ble_gatts_*` and `ble_gattc_*` appear in the generated bindings.
CONFIG_BT_ENABLED=y
# Bluedroid is the DEFAULT stack when BT is enabled and it is the wrong one:
# it is a Kconfig `choice`, so naming NimBLE selects it, and the explicit
# negative below makes the intent unmissable to anyone reading this file.
# CONFIG_BT_BLUEDROID_ENABLED is not set
CONFIG_BT_NIMBLE_ENABLED=y
#
# TWO connections, not the IDF default of 3. This device needs exactly two: one
# inbound (a fitness app on the FTMS peripheral) and one outbound (a heart-rate
# strap on the central). Each slot costs controller and host memory whether or
# not it is used, and "resident memory must not move with connection count"
# starts with bounding the count.
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
# The FTMS Treadmill Data value is 13 bytes and an HR Measurement is 2-3, so
# nothing here needs a large MTU. The default (256) buys a bigger msys pool for
# no benefit; 128 still clears every payload this firmware sends or receives
# with room to spare.
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=128
